// 前置空格
const list = [
  '第\\s?\\d+\\s?页',
  '(福宝)模特',
  '模特',
  '(性感|诱惑)美女',
  '未(分类|分栏|分组|归类)',
  '(高精细|高品质|精品|优秀|优质|超清|高清)vip图',
  '(贵宾|高(端|画质)|无水印|原创(美)?|仙女|极品|高清|超清|精品|日韩|私房|写真|福利|vip|艺术|组|(会员|高级)巨)(巨|套|美|大)图(摄影|集)?',
  '(贵宾|高(端|画质)|无水印|原创(美)?|仙女|极品|高清|超清|精品|日韩|私房|写真|福利|vip|艺术|组|(会员|高级)巨)图(摄影|集)?',
  '(套|美|大)图(摄影|集)?',
  '图(摄影|集)',
  '(性感|妩媚|气质|魅力|风韵|风骚|风情|撩人|着迷|迷人|写真)(私|密)(拍|摄|房)',
  '(私|密|重)(拍|摄|房)',
  '(福利嫩|嫩|极品美|仙女美|艳|福利美|美|魅|靓|辣)模',
  '(魅惑|诱惑)写真',
  'cos(er)?(play)?',
  '萌妹子',
  '无圣光',
  '合辑',
  '高画质',
  '女神',
  '内衣丝袜',
  '免费妹子',
  '明星秀女',
  '着迷影像',
  '性情写真',
  '诱人魅惑',
  '极致仙女',
  '清纯靓丽',
  '风骚',
  '萌妹萝莉',
  '摄影',
  '作品',
  '精摄',
  '风情',
  '(私|重|内|私)购',
  '泄露',
  '重设',
  '影像',
  '(撩|诱)人',
]

// 无前置空格
const list2 = [
  '艺术图',
  '新時代的我們',
  '草榴社區',
  '寫真',
]

const list3 = [
  '[\\u4e00-\\u9fff]{1,2}色',
  '诱惑',
  '迷人',
  '(套|美)图',
  '透视',
  '秀[\\u4e00-\\u9fff]{3,}',
  '汇集', '合集', '亞洲', '美女', '尤物', '丽人', '热辣激凸', '重组',
]

module.exports = [
  ...list.map(e => `\\s${e}\\s?`),
  ...list2.map(e => `${e}\\s?`),
  ...list3.map(e => `\\s${e}\\s|\\s${e}$`),
]
